os.org
#+TITLE:
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

从按下按下电脑开机键到浏览器输入网址打开网页这个过程中到底发生了什么。React在这个过程中做了什么。

** 内核

   当计算机电源被打开时，它会先进行加电自检，然后寻找启动盘，并检查启动盘的0面0磁道1扇区。如果该扇区是引导扇区，那么BIOS会将引导区的512个字节的内容装载到内存中，然后跳转到引导代码的地址，将控制权交给引导代码。

   引导扇区boot 加载loader进内存并跳转，
   Loader：加载内核到内存
   跳入保护模式

   之后跳转内核

   如何与硬件通信：通过处理中断和寄存器

** 保护模式

   在保护模式中，段寄存器指向GDT（Global Descriptor Table），从而提供了段式存储机制。

   GDT描述符包含DPL（Descriptor Privilege Level）属性。

   程序从一个代码段转移到另一个代码段之前，目标代码段的选择子会被加载到cs中。作为加载过程的一部分，处理器将会检查描述符的界限、类型、特权级等内容。如果检验成功，cs将被加载，程序控制将转移到新的代码段中，从eip指示的位置开始执行。

   逻辑地址--[分段机制]->线性地址--[分页机制]->物理地址

   线性地址通过页目录表映射到物理地址。

   键盘输入->键盘编码器->键盘控制器->中断控制器

   通过VGA寄存器中的值来控制内存中内容的现实。

   当某个进程调用 ~printf()~ 时，为每个进程指定一个与之相对应的TTY。

** 进程调度

** 进程间通信

** 数据库
